{ 
  "description": "Visual Web Terminal offre une nouvelle expérience de développement pour créer des applications de cloud en combinant la puissance des diverses interfaces de ligne de commande avec la convivialité des visualisations. Visual Web Terminal vous permet d'exécuter des commandes à partir de différents outils, d'afficher et de parcourir des modèles de données complexes \"JSON\" et \"YAML\", ainsi que d'afficher des données opérationnelles. Construit à l'aide du code source ouvert KUI : https://github.com/IBM/kui.",
  "gettingStarted": "Visual Web Terminal est une interface qui combine la commodité d'une interface graphique avec la vitesse d'une interface de ligne de commande. Après l'exécution d'une commande, les données sont renvoyées dans un format de tableau interactif qui peut afficher plus de détails sur un élément lorsque vous sélectionnez cet élément dans le tableau.\n \n Outre les commandes spécifiques à Visual Web Terminal, les commandes suivantes sont également prises en charge :\n * Commandes \"bash\" de base sélectionnées\n * Commandes \"cloudctl\"\n * Commandes \"helm\"\n * Commandes \"istioctl\"\n * Commandes \"kubectl\" \n * Commandes \"oc\"\n \n**Applications**\n \n Vous pouvez afficher des informations sur les applications et y accéder dans votre environnement à l'aide de commandes \"kubectl\" avec Visual Web Terminal.\n \n * Afficher toutes les applications :\n \n \"kubectl get applications\"\n \n * Afficher tous les déploiements :\n \n \"kubectl get deployments\"\n \n * Afficher tous les canaux :\n \n \"kubectl get channels\"\n \n **Recherche** (disponible uniquement lorsque IBM Cloud Pak for Multicloud Management est installé sur le cluster) \n \n Vous pouvez rechercher une chaîne ou un attribut dans l'ensemble de votre environnement de gestion de cloud connecté à l'aide de la commande \"search\". Vous pouvez restreindre les résultats de votre recherche à l'aide de filtres en les ajoutant à la fin de votre commande de recherche.\n \n La commande \"search\" renvoie les résultats qui sont catégorisés par type sous forme de tableau. Vous pouvez trier les données du tableau en sélectionnant l'en-tête de colonne des données que vous souhaitez utiliser pour le tri.\n \n Pour afficher des détails supplémentaires sur un élément renvoyé dans le tableau, sélectionnez le nom de l'élément.\n \n * Exemple de recherche d'une adresse IP :\n \n `search 192.0.0.1`\n \n * Exemples de recherches à l'aide de filtres :\n \n Type de ressource :\n \n `search kind:deployment`\n \n * Propriétaire :\n \n search owner:jdoe\n \n * Plusieurs filtres :\n \n `search kind:deployment owner:jdoe`"
}
