{ 
  "description": "Visual Web Terminal ofrece una nueva experiencia de desarrollo para crear aplicaciones nativas de nube combinando la potencia de diversas CLI con la comodidad de las visualizaciones. Visual Web Terminal le permite ejecutar mandatos desde diversas herramientas, visualizar modelos de datos `JSON` y `YAML` complejos y navegar por ellos, así como ver datos operativos. Se ha creado utilizando el código de proyecto de código abierto de KUI: https://github.com/IBM/kui.",
  "gettingStarted": "Visual Web Terminal es una interfaz que combina la comodidad de una interfaz gráfica de usuario con la velocidad de una interfaz de línea de mandatos. Después de ejecutar un mandato, los datos se devuelven en un formato de tabla interactivo que puede visualizar más detalles sobre un elemento cuando se selecciona dicho elemento en la tabla.\n \n Además de mandatos que son específicos de Visual Web Terminal, también se soportan los mandatos siguientes:\n * Mandatos `bash` básicos seleccionados\n * mandatos `cloudctl`\n * mandatos `helm`\n * mandatos `istioctl`\n * mandatos `kubectl` \n * mandatos `oc`\n \n**Aplicaciones**\n \n Puede ver información sobre las aplicaciones del entorno multinube y acceder a dicha información utilizando mandatos `kubectl` con Visual Web Terminal.\n \n * Mostrar todas las aplicaciones:\n \n `kubectl get applications`\n \n * Mostrar todos los despliegues:\n \n `kubectl get deployments`\n \n * Mostrar todos los canales:\n \n `kubectl get channels`\n \n **Buscar**\n \n Puede buscar una serie o un atributo en el entorno de gestión de nube conectado entero utilizando el mandato `search`. Puede reducir los resultados de búsqueda con filtros añadiéndolos al final del mandato de búsqueda.\n \n El mandato `search` devuelve resultados que se categorizan por tipo en un formato de tabla. Puede ordenar los datos de la tabla seleccionando la cabecera de columna para los datos que desea utilizar para ordenar.\n \n Para ver detalles adicionales sobre un elemento que se ha devuelto en la tabla, seleccione el nombre del elemento.\n \n * Ejemplo de una búsqueda para una dirección IP:\n \n `search 192.0.0.1`\n \n * Ejemplos de búsquedas que utilizan filtros:\n \n Clase de recurso:\n \n `search kind:deployment`\n \n * Propietario:\n \n search owner:jdoe\n \n * Varios filtros:\n \n `search kind:deployment owner:jdoe`"
}
