{
  "productName": "Visual Web Terminal",
  "productTitle": "Multicloud Management Enhanced Shell",
  "ogSiteName": "Visual Web Terminal Shell",
  "ogTitle": "Visual Web Terminal: The Hybrid CLI Cloud Shell",
  "ogUrl": "https://kui.tools",
  "ogDescription": "The Visual Web Terminal offers a new development experience for building cloud-native applications. By combining the power of familiar CLIs with visualizations in high-impact areas, the Visual Web Terminal enables you to display and navigate complex JSON and YAML data models, integrate disparate tooling, and provides quick access to aggregate views of operational data.",
  "ogImage": "http://content.kui-shell.org/images/ogImage.jpg",
  "ogLabel1": "Clone on GitHub",
  "ogData1": "https://github.com/IBM/kui",
  "ogLabel2": "Download Now",
  "ogData2": "https://tarball.kui-shell.org",
  "userAgent": "Kui-Shell",
  "description": {
        "en_US": "The Visual Web Terminal offers a new development experience for building cloud-native applications by combining the power of various CLIs with the convenience of visualizations. The Visual Web Terminal enables you to run commands from various tools, display and navigate complex `JSON` and `YAML` data models, and view operational data. Built using the KUI open source project code: https://github.com/IBM/kui.",
        "de": "Durch die Kombination der Leistungsfähigkeit von verschiedenen CLIs mit dem Komfort von Visualisierungen bietet Visual Web Terminal eine neue Entwicklungsumgebung für die Erstellung von Cloud-nativen Anwendungen. Mit Visual Web Terminal können Sie Befehle aus einer Reihe verschiedener Tools ausführen, komplexe JSON- und YAML-Datenmodelle anzeigen und in ihnen navigieren sowie Operationsdaten darstellen. Das Tool wird mithilfe des Open-Source-Projektcodes KUI erstellt: https://github.com/IBM/kui. ",
        "es": "Visual Web Terminal ofrece una nueva experiencia de desarrollo para crear aplicaciones nativas de nube combinando la potencia de diversas CLI con la comodidad de las visualizaciones. Visual Web Terminal le permite ejecutar mandatos desde diversas herramientas, visualizar modelos de datos `JSON` y `YAML` complejos y navegar por ellos, así como ver datos operativos. Se ha creado utilizando el código de proyecto de código abierto de KUI: https://github.com/IBM/kui.",
        "fr": "Visual Web Terminal offre une nouvelle expérience de développement pour créer des applications de cloud en combinant la puissance des diverses interfaces de ligne de commande avec la convivialité des visualisations. Visual Web Terminal vous permet d'exécuter des commandes à partir de différents outils, d'afficher et de parcourir des modèles de données complexes \"JSON\" et \"YAML\", ainsi que d'afficher des données opérationnelles. Construit à l'aide du code source ouvert KUI : https://github.com/IBM/kui.",
        "it": "Il terminale Visual Web offre una nuova esperienza di sviluppo per la creazione di applicazioni cloud native, combinando la potenza di numerose CLI con i vantaggi delle visualizzazioni. Il terminale Visual Web consente di eseguire comandi da vari strumenti, visualizzare e navigare in modelli di dati `JSON` e `YAML` complessi, e di visualizzare i dati operativi. È basato sul codice progetto open source KUI: https://github.com/IBM/kui.",
        "ja": "Visual Web Terminal はさまざまな CLI の能力と可視化の利便性を組み合わせることで、クラウド・ネイティブのアプリケーションのビルドにおける新しい開発エクスペリエンスを提供します。Visual Web Terminal を使用すると、さまざまなツールからコマンドを実行したり、複雑な「JSON」データ・モデルと「YAML」データ・モデルを表示およびナビゲートしたり、運用データを表示したりできます。KUI オープン・ソース・プロジェクト・コード https://github.com/IBM/kui を使用してビルドされました。",
        "ko": "Visual Web Terminal은 다양한 CLI의 기능과 시각화의 편의성을 결합하여 클라우드 기반의 애플리케이션을 빌드하는 데 필요한 새로운 개발 경험을 제공합니다. Visual Web Terminal을 사용하면 다양한 도구에서 명령을 실행할 수 있으며 복합 `JSON` 및 `YAML` 데이터 모델을 표시하고 탐색할 수 있으며 운영 데이터를 확인할 수 있습니다. KUI 오픈 소스 프로젝트 코드를 사용하여 빌드하십시오. https://github.com/IBM/kui.",
        "pt_BR": "O Visual Web Terminal oferece uma nova experiência de desenvolvimento para construir aplicativos em nuvem nativa, combinando o poder de várias CLIs com a conveniência das visualizações. O Visual Web Terminal permite executar comandos a partir de várias ferramentas, exibir e navegar por modelos de dados `JSON` e `YAML` complexos e visualizar dados operacionais. Desenvolvido usando o código do projeto de software livre do KUI: https://github.com/IBM/kui.",
        "zh_CN": "Visual Web Terminal 提供新的开发体验，通过将各个 CLI 的强大功能与可视化的便利性相组合，构建云/本机应用程序。Visual Web Terminal 使您能够从各种工具运行命令、显示和浏览复杂的“JSON”和“YAML”数据模型，以及查看运作数据。使用 KUI 开放式源代码项目代码进行构建：https://github.com/IBM/kui。",
        "zh_TW": "「視覺化 Web 終端機」透過結合各種 CLI 的能力與視覺化的便利，提供新的開發體驗以建置雲端原生應用程式。「視覺化 Web 終端機」可讓您從各個工具執行指令，顯示及導覽複雜的 'JSON' 及 'YAML' 資料模型，以及檢視作業資料。使用 KUI 開放程式碼專案代碼建置：https://github.com/IBM/kui。"
  },
  "gettingStarted": {
        "en_US": "The Visual Web Terminal is an interface that combines the convenience of a graphical user interface with the speed of a command-line interface. After running a command, the data is returned in an interactive table format that can display more detail about an item when you select that item in the table.\n \n In addition to commands that are specific to the Visual Web Terminal, the following commands are also supported:\n * Selected basic `bash` commands\n * `cloudctl` commands\n * `helm` commands\n * `istioctl` commands\n * `kubectl` commands \n * `oc` commands\n \n**Applications**\n \n You can view and access information about the applications in your multicloud environment by using `kubectl` commands with the Visual Web Terminal.\n \n * Show all applications:\n \n `kubectl get applications`\n \n * Show all deployments:\n \n `kubectl get deployments`\n \n * Show all channels:\n \n `kubectl get channels`\n \n**Search**\n \n You can search for a string or attribute across your entire connected cloud management environment by using the `search` command. You can narrow your search results with filters by adding them to the end of your search command.\n \n The `search` command returns results that are categorized by type in a table format. You can sort the data in the table by selecting the column heading for the data that you want to use to sort.\n \n To view additional details about an item that was returned in the table, select the name of the item.\n \n * Example of a search for an IP address:\n \n `search 192.0.0.1`\n \n * Examples of searches using filters:\n \n Resource kind:\n \n `search kind:deployment`\n \n * Owner:\n \n search owner:jdoe\n \n * Multiple filters:\n \n `search kind:deployment owner:jdoe`",
        "de": "Visual Web Terminal ist eine Schnittstelle, die den Komfort einer grafischen Benutzerschnittstelle mit der Geschwindigkeit einer Befehlszeilenschnittstelle kombiniert. Nach der Ausführung eines Befehls werden die Daten im Format einer interaktiven Tabelle zurückgegeben, in der weitere Details zu einem Element angezeigt werden können, wenn das Element in der Tabelle ausgewählt wird. \n \n Neben Befehlen, die nur für Visual Web Terminal gültig sind, werden auch die folgenden Befehle unterstützt: \n * Ausgewählte 'bash'-Basisbefehle \n * 'cloudctl'-Befehle \n * 'helm'-Befehle \n * 'istioctl'-Befehle \n * 'kubectl'-Befehle \n * 'oc'-Befehle \n \n**Anwendungen**\n \n Sie können Informationen zu den Anwendungen in Ihrer Multicloud-Umgebung anzeigen und darauf zugreifen. Verwenden Sie dazu 'kubectl'-Befehle mit Visual Web Terminal. \n \n * Alle Anwendungen anzeigen: \n \n 'kubectl get applications'\n \n * Alle Bereitstellungen anzeigen: \n \n 'kubectl get deployments'\n \n * Alle Kanäle anzeigen: \n \n 'kubectl get channels'\n \n **Suchen**\n \n Sie können den Befehl 'search' verwenden, um eine Zeichenfolge oder ein Attribut in der gesamten verbundenen Cloud-Management-Umgebung zu suchen. Sie können Filter zum Ende des Suchbefehls hinzufügen, um die Suchergebnisse einzugrenzen. \n \n Der Befehl 'search' gibt Ergebnisse zurück, die in einem Tabellenformat nach Typ kategorisiert werden. Die Daten in der Tabelle können sortiert werden, indem die Überschrift der Datenspalte, nach der sortiert werden soll, ausgewählt wird. \n \n Wählen Sie den Namen eines zurückgegebenen Elements in der Tabelle aus, um zusätzliche Details zu diesem Element anzuzeigen. \n \n * Beispiel für eine Suche nach einer IP-Adresse: \n \n `search 192.0.0.1`\n \n * Beispiele für die Suche mit Filtern: \n \n Ressourcentyp: \n \n `search kind:deployment`\n \n * Eigner: \n \n search owner:jdoe\n \n * Mehrere Filter:\n \n `search kind:deployment owner:jdoe` ",
        "es": "Visual Web Terminal es una interfaz que combina la comodidad de una interfaz gráfica de usuario con la velocidad de una interfaz de línea de mandatos. Después de ejecutar un mandato, los datos se devuelven en un formato de tabla interactivo que puede visualizar más detalles sobre un elemento cuando se selecciona dicho elemento en la tabla.\n \n Además de mandatos que son específicos de Visual Web Terminal, también se soportan los mandatos siguientes:\n * Mandatos `bash` básicos seleccionados\n * mandatos `cloudctl`\n * mandatos `helm`\n * mandatos `istioctl`\n * mandatos `kubectl` \n * mandatos `oc`\n \n**Aplicaciones**\n \n Puede ver información sobre las aplicaciones del entorno multinube y acceder a dicha información utilizando mandatos `kubectl` con Visual Web Terminal.\n \n * Mostrar todas las aplicaciones:\n \n `kubectl get applications`\n \n * Mostrar todos los despliegues:\n \n `kubectl get deployments`\n \n * Mostrar todos los canales:\n \n `kubectl get channels`\n \n **Buscar**\n \n Puede buscar una serie o un atributo en el entorno de gestión de nube conectado entero utilizando el mandato `search`. Puede reducir los resultados de búsqueda con filtros añadiéndolos al final del mandato de búsqueda.\n \n El mandato `search` devuelve resultados que se categorizan por tipo en un formato de tabla. Puede ordenar los datos de la tabla seleccionando la cabecera de columna para los datos que desea utilizar para ordenar. \n \n Para ver detalles adicionales sobre un elemento que se ha devuelto en la tabla, seleccione el nombre del elemento. \n \n * Ejemplo de una búsqueda para una dirección IP:\n \n `search 192.0.0.1`\n \n * Ejemplos de búsquedas que utilizan filtros:\n \n Clase de recurso:\n \n `search kind:deployment`\n \n * Propietario:\n \n search owner:jdoe\n \n * Varios filtros:\n \n `search kind:deployment owner:jdoe`",
        "fr": "Visual Web Terminal est une interface qui combine la commodité d'une interface graphique avec la vitesse d'une interface de ligne de commande. Après l'exécution d'une commande, les données sont renvoyées dans un format de tableau interactif qui peut afficher plus de détails sur un élément lorsque vous sélectionnez cet élément dans le tableau.\n \n Outre les commandes spécifiques à Visual Web Terminal, les commandes suivantes sont également prises en charge :\n * Commandes \"bash\" de base sélectionnées\n * Commandes \"cloudctl\"\n * Commandes \"helm\"\n * Commandes \"istioctl\"\n * Commandes \"kubectl\" \n * Commandes \"oc\"\n \n**Applications**\n \n Vous pouvez afficher des informations sur les applications et y accéder dans votre environnement multicloud à l'aide de commandes \"kubectl\" avec Visual Web Terminal.\n \n * Afficher toutes les applications :\n \n \"kubectl get applications\"\n \n * Afficher tous les déploiements :\n \n \"kubectl get deployments\"\n \n * Afficher tous les canaux :\n \n \"kubectl get channels\"\n \n **Recherche**\n \n Vous pouvez rechercher une chaîne ou un attribut dans l'ensemble de votre environnement de gestion de cloud connecté à l'aide de la commande \"search\". Vous pouvez restreindre les résultats de votre recherche à l'aide de filtres en les ajoutant à la fin de votre commande de recherche.\n \n La commande \"search\" renvoie les résultats qui sont catégorisés par type sous forme de tableau. Vous pouvez trier les données du tableau en sélectionnant l'en-tête de colonne des données que vous souhaitez utiliser pour le tri.\n \n Pour afficher des détails supplémentaires sur un élément renvoyé dans le tableau, sélectionnez le nom de l'élément.\n \n * Exemple de recherche d'une adresse IP :\n \n `search 192.0.0.1`\n \n * Exemples de recherches à l'aide de filtres :\n \n Type de ressource :\n \n `search kind:deployment`\n \n * Propriétaire :\n \n search owner:jdoe\n \n * Plusieurs filtres :\n \n `search kind:deployment owner:jdoe`",
        "it": "Il terminale Visual Web è un'interfaccia che combina i vantaggi di un'interfaccia utente grafica con la velocità di un'interfaccia di riga comandi. Dopo aver eseguito un comando, i dati vengono restituiti in un formato tabella interattivo che può visualizzare maggiori dettagli su un elemento quando tale elemento viene selezionato nella tabella.\n \n Oltre ai comandi specifici per il terminale Visual Web, sono supportati anche i seguenti comandi:\n * Comandi `bash` di base selezionati\n * Comandi `cloudctl` \n * Comandi `helm` \n * Comandi `istioctl` \n * Comandi `kubectl` \n * Comandi `oc` \n \n**Applicazioni**\n \n È possibile visualizzare ed accedere alle informazioni sulle applicazioni nell'ambiente multicloud utilizzando i comandi `kubectl` con il terminale Visual Web.\n \n * Mostra tutte le applicazioni:\n \n `kubectl get applications`\n \n * Mostra tutte le distribuzioni:\n \n `kubectl get deployments`\n \n * Mostra tutti i canali:\n \n `kubectl get channels`\n \n **Ricerca**\n \n È possibile ricercare una stringa o un attributo nell'intero ambiente di gestione cloud connesso utilizzando il comando `search`. È possibile ridurre i risultati della ricerca con i filtri, aggiungendoli alla fine del comando di ricerca.\n \n Il comando `search` restituisce risultati che sono categorizzati per tipo in formato tabella. È possibile ordinare i dati nella tabella selezionando l'intestazione di colonna per i dati che si desidera utilizzare per l'ordinamento.\n \n Per visualizzare ulteriori dettagli su un elemento restituito nella tabella, selezionare il nome dell'elemento.\n \n * Esempio di ricerca per indirizzo IP:\n \n `search 192.0.0.1`\n \n * Esempi di ricerche con filtri:\n \n Tipologia di risorsa:\n \n `search kind:deployment`\n \n * Proprietario:\n \n search owner:jdoe\n \n * Filtri multipli:\n \n `search kind:deployment owner:jdoe`",
        "ja": "Visual Web Terminal は、グラフィカル・ユーザー・インターフェースの利便性とコマンド・ライン・インターフェースのスピードを組み合わせたインターフェースです。コマンドを実行すると、データは対話型のテーブル形式で返され、テーブル内の項目を選択すると、その項目の詳細を表示できます。\n \n Visual Web Terminal に固有のコマンドに加えて、以下のコマンドもサポートされています。\n * 選択された基本的な「bash」コマンド\n * 「cloudctl」コマンド\n * 「helm」コマンド\n * 「istioctl」コマンド\n * 「kubectl」コマンド \n * 「oc」コマンド\n \n**アプリケーション**\n \n Visual Web Terminal で「kubectl」コマンドを使用すると、マルチクラウド環境内のアプリケーションに関する情報を表示およびアクセスできます。\n \n * すべてのアプリケーションの表示:\n \n 「kubectl get applications」\n \n * すべてのデプロイメントの表示:\n \n 「kubectl get deployments」\n \n * すべてのチャネルの表示:\n \n 「kubectl get channels」\n \n **検索**\n \n 「search」コマンドを使用して、接続されているクラウド管理環境全体でストリングまたは属性を検索できます。「search」コマンドの最後に追加することで、フィルターを使用して検索結果を絞り込むことができます。\n \n 「search」コマンドは、型で分類されたテーブル形式の結果を返します。 テーブル内のデータは、列見出しを選択すると、その列のデータで並べ替えることができます。\n \n テーブルに返された項目に関する追加の詳細を表示するには、その項目の名前を選択します。\n \n * IP アドレスの検索例:\n \n 「search 192.0.0.1」\n \n * フィルターを使用した検索例:\n \n リソースの種類:\n \n 「search kind:deployment」\n \n * 所有者:\n \n 「search owner:jdoe」\n \n * 複数のフィルター:\n \n 「search kind:deployment owner:jdoe」",
        "ko": "Visual Web Terminal은 그래픽 사용자 인터페이스의 편의성과 명령행 인터페이스의 속도를 결합한 인터페이스입니다. 명령을 실행한 후에 데이터가 대화식 테이블 형식으로 리턴되며 사용자가 테이블에서 항목을 선택하면 항목에 대한 더 자세한 정보가 표시됩니다.\n \nVisual Web Terminal에 특정한 명령 외에 다음 명령도 지원됩니다.\n * 선택된 기본 `bash` 명령\n * `cloudctl` 명령\n * `helm` 명령\n * `istioctl` 명령\n * `kubectl` 명령 \n * `oc` 명령\n \n**애플리케이션**\n \n Visual Web Terminal과 함께 `kubectl` 명령을 사용하여 멀티클라우드 환경에서 애플리케이션에 대한 정보를 확인하고 액세스할 수 있습니다.\n \n * 모든 애플리케이션 표시:\n \n `kubectl get applications`\n \n * 모든 배치 표시:\n \n `kubectl get deployments`\n \n * 모든 채널 표시:\n \n `kubectl get channels`\n \n **검색**\n \n `search` 명령을 사용하여 연결된 전체 클라우드 관리 환경에 걸쳐 문자열 또는 속성을 검색할 수 있습니다. 검색 명령 끝에 필터를 추가하여 해당 필터를 통해 검색 결과를 좁힐 수 있습니다.\n \n `search` 명령은 테이블 형식으로 유형별로 분류된 결과를 리턴합니다. 정렬할 데이터에 대한 열 표제를 선택하여 테이블에서 데이터를 정렬할 수 있습니다.\n \n 테이블에서 리턴된 항목에 대한 추가 세부사항을 보려면 항목의 이름을 선택하십시오.\n \n * IP 주소 검색의 예:\n \n `search 192.0.0.1`\n \n * 필터를 사용한 검색의 예:\n \n 리소스 유형:\n \n `search kind:deployment`\n \n * 소유자:\n \n 검색 소유자:jdoe\n \n * 다중 필터:\n \n `search kind:deployment owner:jdoe`",
        "pt_BR": "O Terminal da Web Visual é uma interface que combina a conveniência de uma interface gráfica com o usuário com a velocidade de uma interface da linha de comandos. Após a execução de um comando, os dados são retornados em um formato de tabela interativo que pode exibir mais detalhes sobre um item quando você seleciona esse item na tabela.\n \n Além dos comandos que são específicos do Visual Web Terminal, os comandos a seguir também são suportados:\n * comandos `bash` básicos selecionados\n * comandos `cloudctl`\n * comandos `helm`\n * comandos `istioctl`\n * comandos `kubectl`  \n * comandos `oc`\n \n**Aplicativos**\n \n É possível visualizar e acessar informações sobre os aplicativos em seu ambiente de várias nuvens usando comandos `kubectl` com o Visual Web Terminal.\n \n * Mostrar todos os aplicativos:\n \n `kubectl get applications`\n \n * Mostrar todas as implementações:\n \n `kubectl get deployments`\n \n * Mostrar todos os canais:\n \n `kubectl get channels`\n \n **Procura**\n \n É possível procurar uma sequência ou um atributo em seu ambiente inteiro de gerenciamento de nuvem conectado usando o comando `search`. É possível limitar seus resultados da procura com filtros, incluindo-os no final do comando de procura.\n \n O comando `search` retorna resultados que são categorizados por tipo em um formato de tabela. É possível classificar os dados na tabela selecionando o título da coluna para os dados que você deseja usar para classificação.\n \n Para visualizar detalhes adicionais sobre um item que foi retornado na tabela, selecione o nome do item.\n \n * Exemplo de uma procura para um endereço IP:\n \n `search 192.0.0.1`\n \n * Exemplos de procuras usando filtros:\n \n Tipo de recurso:\n \n `search kind:deployment`\n \n * Proprietário:\n \n search owner:jdoe\n \n * Múltiplos filtros:\n \n `search kind:deployment owner:jdoe`",
        "zh_CN": "Visual Web Terminal 是将图形用户界面的便利性与命令行界面的速度相组合的接口。在运行命令后，将以交互式表格格式返回数据，这可在您选择表中的项时显示有关此项的更多详细信息。\n \n 除了特定于 Visual Web Terminal 的命令，还支持以下命令：\n * 选中的基本“bash”命令\n * “cloudctl”命令\n * “helm”命令\n * “istioctl”命令\n * “kubectl”命令\n * “oc”命令\n \n**应用程序**\n \n 您可以通过 Visual Web Terminal 使用“kubectl”命令来查看和访问有关多云环境中的应用程序的信息。\n \n * 显示所有应用程序：\n \n  “kubectl get applications”\n \n * 显示所有部署：\n \n “kubectl get deployments”\n \n * 显示所有通道：\n \n “kubectl get channels”\n \n **搜索**\n \n 您可以使用“search”命令在整个连接的云管理环境中搜索字符串或属性。可以通过向搜索命令末尾添加过滤器来使用过滤器缩小搜索结果的范围。\n \n “search”命令返回按表格式进行分类的结果。您可以通过选择想要用于排序的数据的列标题，对表中的数据进行排序。\n \n 要查看有关表中返回的某个项的其他详细信息，请选择此项的名称。\n \n * IP 地址搜索的示例：\n \n “search 192.0.0.1”\n \n * 使用过滤器的搜索示例：\n \n 资源种类：\n \n “search kind:deployment”\n \n * 所有者：\n \n search owner:jdoe\n \n * 多个过滤器：\n \n “search kind:deployment owner:jdoe”",
        "zh_TW": "「視覺化 Web 終端機」是一種介面，結合圖形使用者介面的便利與指令行介面的速度。執行指令之後，會以互動式表格格式傳回資料，當您在表格中選取該項目時，該格式可以顯示項目的更多相關明細。\n \n 除了「視覺化 Web 終端機」的特定指令之外，也支援下列指令：\n * 所選取的基本 `bash` 指令\n * `cloudctl` 指令\n * `helm` 指令\n * `istioctl` 指令\n * `kubectl` 指令\n * `oc` 指令\n \n**應用程式**\n \n 您可以透過搭配使用 `kubectl` 指令與「視覺化 Web 終端機」，檢視及存取多雲端環境中應用程式的相關資訊。\n \n * 顯示所有應用程式：\n \n `kubectl get applications`\n \n * 顯示所有部署：\n \n `kubectl get deployments`\n \n * 顯示所有通道：\n \n `kubectl get channels`\n \n **搜尋**\n \n 您可以透過使用 `search` 指令，在整個連接的雲端管理環境中搜尋字串或屬性。您可以透過將過濾器新增至搜尋指令的結尾，以過濾器縮小您的搜尋結果的範圍。\n \n `search` 指令傳回以表格格式按類型分類的結果。您可以透過為您要用於排序的資料選取直欄標題，排序表格中的資料。\n \n 若要檢視表格中傳回之項目的相關其他詳細資料，請選取項目的名稱。\n \n * 搜尋 IP 位址的範例：\n \n `search 192.0.0.1`\n \n * 使用過濾器的搜尋範例：\n \n 資源類型：\n \n `search kind:deployment`\n \n * 擁有者：\n \n search owner:jdoe\n \n * 多個過濾器：\n \n `search kind:deployment owner:jdoe`"
  },
  "defaultTheme": "IBM Light",
  "cssHome": "/kui/",
  "resourceRoot": "/kui",
  "contentSecurityPolicy": "default-src 'none'; style-src 'self' 'unsafe-inline'; img-src 'self' file: 'nonce-{kuiNonce}' data:; script-src 'self' 'nonce-{kuiNonce}' 'unsafe-eval'; font-src 'self' file:; connect-src 'self' wss:",
  "themes": [
    { "name": "IBM Light", "css": "/kui/themes/carbon-gray10.css", "style": "light" },
    { "name": "IBM Dark", "css": "/kui/themes/carbon-gray90.css", "style": "dark" }
  ],
  "css": [],
  "cssOverrides": ["top-tab-stripe-alt.css", "ibm-plex.css"],
  "bodyCss": ["kui--bottom-input", "kui-alternate"],
  "tabStripe": "top-tab-stripe.css",
  "tableStyle": "Medium",
  "filesystemIcons": {
    "darwin": "icons/icns/kui.icns",
    "win32": "icons/ico/kui.ico",
    "linux": "icons/png/kui.png"
  }
}
