{
  "about:content": "Visual Web Terminal le ofrece una nueva experiencia de desarrollo de aplicaciones nativas de nube combinando la potencia de varias CLI y la comodidad de las visualizaciones. Visual Web Terminal le permite ejecutar mandatos desde diferentes herramientas, visualizar y navegar por modelos de datos`JSON` y `YAML` complejos y ver datos operativos. Basado en el uso de código del proyecto de código abierto KUI: https://github.com/IBM/kui.",
  "gettingStarted:content": "Visual Web Terminal es una interfaz que combina la comodidad de una interfaz gráfica de usuario con la velocidad de una interfaz de línea de mandatos. Después de ejecutar un mandato, se devuelven los datos con un formato de tabla interactiva que puede mostrar más detalles acerca de un elemento cuando selecciona este elemento en la tabla.\n \n Además de los mandatos que son específicos de Visual Web Terminal, también se da soporte a los mandatos siguientes:\n * Mandatos `bash` básicos seleccionados\n * Mandatos `cloudctl`\n * Mandatos `helm`\n * Mandatos `istioctl`\n * Mandatos `kubectl`\n * Mandatos `oc`\n \n**Aplicaciones**\n \n Puede ver y acceder a la información sobre las aplicaciones de su entorno utilizando los mandatos `kubectl` con Visual Web Terminal.\n \n * Mostrar todas las aplicaciones:\n \n `kubectl get applications`\n \n * Mostrar todos los despliegues:\n \n `kubectl get deployments`\n \n * Mostrar todos los canales:\n \n `kubectl get channels`\n \n **Buscar** (solo está disponible cuando se instala IBM Cloud Pak for Multicloud Management en el clúster)\n \n Puede buscar una serie o atributo en todo su entorno de gestión de nube conectado utilizando el mandato `search`. Puede acotar los resultados de la búsqueda añadiendo filtros al final del mandato de búsqueda.\n \n El mandato `search` devuelve resultados clasificados por tipo con un formato de tabla. Puede ordenar los datos de la tabla seleccionando la cabecera de columna para los datos que desee utilizar para ordenarlos.\n \n Para ver detalles adicionales acerca de un elemento que se ha devuelto en la tabla, seleccione el nombre del elemento.\n \n * Ejemplo de la búsqueda de una dirección IP:\n \n `search 192.0.0.1`\n \n * Ejemplos de búsquedas utilizando filtros:\n \n Tipo de recurso:\n \n `search kind:deployment`\n \n * Propietario:\n \n search owner:jdoe\n \n * Varios filtros:\n \n `search kind:deployment owner:jdoe`"
}