{
  "about": "Produktinfo",
  "gettingStarted": "Erste Schritte",
  "configure": "Konfigurieren",
  "about:content": "Durch die Kombination der Leistungsfähigkeit von verschiedenen CLIs mit dem Komfort von Visualisierungen bietet Visual Web Terminal eine neue Entwicklungsumgebung für die Erstellung von Cloud-nativen Anwendungen. Mit Visual Web Terminal können Sie Befehle aus einer Reihe verschiedener Tools ausführen, komplexe JSON- und YAML-Datenmodelle anzeigen und in ihnen navigieren sowie Operationsdaten darstellen. Das Tool wird mithilfe des Open-Source-Projektcodes KUI erstellt: https://github.com/IBM/kui. ",
  "gettingStarted:content": "Visual Web Terminal ist eine Schnittstelle, die den Komfort einer grafischen Benutzerschnittstelle mit der Geschwindigkeit einer Befehlszeilenschnittstelle kombiniert. Nach der Ausführung eines Befehls werden die Daten im Format einer interaktiven Tabelle zurückgegeben, in der weitere Details zu einem Element angezeigt werden können, wenn das Element in der Tabelle ausgewählt wird. \n \n Neben Befehlen, die nur für Visual Web Terminal gültig sind, werden auch die folgenden Befehle unterstützt: \n * Ausgewählte 'bash'-Basisbefehle \n * 'helm'-Befehle \n * 'istioctl'-Befehle \n * 'kubectl'-Befehle \n * 'oc'-Befehle \n \n**Anwendungen**\n \n Sie können Informationen zu den Anwendungen in Ihrer Umgebung anzeigen und darauf zugreifen. Verwenden Sie dazu 'kubectl'-Befehle mit Visual Web Terminal. \n \n * Alle Anwendungen anzeigen: \n \n 'kubectl get applications'\n \n * Alle Bereitstellungen anzeigen: \n \n 'kubectl get deployments'\n \n * Alle Kanäle anzeigen: \n \n 'kubectl get channels'\n \n **Suchen**\n \n Sie können den Befehl 'search' verwenden, um eine Zeichenfolge oder ein Attribut in der gesamten verbundenen Cloud-Management-Umgebung zu suchen. Sie können Filter zum Ende des Suchbefehls hinzufügen, um die Suchergebnisse einzugrenzen. \n \n Der Befehl 'search' gibt Ergebnisse zurück, die in einem Tabellenformat nach Typ kategorisiert werden. Die Daten in der Tabelle können sortiert werden, indem die Überschrift der Datenspalte, nach der sortiert werden soll, ausgewählt wird. \n \n Wählen Sie den Namen eines zurückgegebenen Elements in der Tabelle aus, um zusätzliche Details zu diesem Element anzuzeigen. \n \n * Beispiel für eine Suche nach einer IP-Adresse: \n \n `search 192.0.0.1`\n \n * Beispiele für die Suche mit Filtern: \n \n Ressourcentyp: \n \n `search kind:deployment`\n \n * Eigner: \n \n search owner:jdoe\n \n * Mehrere Filter:\n \n `search kind:deployment owner:jdoe` "
}