{
  "about": "About",
  "gettingStarted": "Getting Started",
  "configure": "Configure",
  "about:content": "The Visual Web Terminal offers a new development experience for building cloud-native applications by combining the power of various CLIs with the convenience of visualizations. The Visual Web Terminal enables you to run commands from various tools, display and navigate complex `JSON` and `YAML` data models, and view operational data. Built using the KUI open source project code: https://github.com/IBM/kui.",
  "gettingStarted:content": "The Visual Web Terminal is an interface that combines the convenience of a graphical user interface with the speed of a command-line interface. After running a command, the data is returned in an interactive table format that can display more detail about an item when you select that item in the table.\n \n In addition to commands that are specific to the Visual Web Terminal, the following commands are also supported:\n * Selected basic `bash` commands\n * `kubectl` commands \n * `oc` commands\n \n**Applications**\n \n You can view and access information about the applications in your environment by using `kubectl` commands with the Visual Web Terminal.\n \n * Show all applications:\n \n `kubectl get applications`\n \n * Show all deployments:\n \n `kubectl get deployments`\n \n * Show all channels:\n \n `kubectl get channels`\n \n**Search**\n \n You can search for a string or attribute across your entire connected cloud management environment by using the `search` command. You can narrow your search results with filters by adding them to the end of your search command.\n \n The `search` command returns results that are categorized by type in a table format. You can sort the data in the table by selecting the column heading for the data that you want to use to sort.\n \n To view additional details about an item that was returned in the table, select the name of the item.\n \n * Example of a search for an IP address:\n \n `search 192.0.0.1`\n \n * Examples of searches using filters:\n \n Resource kind:\n \n `search kind:deployment`\n \n * Owner:\n \n search owner:jdoe\n \n * Multiple filters:\n \n `search kind:deployment owner:jdoe`"
}