{
  "about": "Informazioni su",
  "gettingStarted": "Introduzione",
  "configure": "Configura",
  "about:content": "Il terminale Visual Web offre una nuova esperienza di sviluppo per la creazione di applicazioni cloud native, combinando la potenza di numerose CLI con i vantaggi delle visualizzazioni. Il terminale Visual Web consente di eseguire comandi da vari strumenti, visualizzare e navigare in modelli di dati `JSON` e `YAML` complessi, e di visualizzare i dati operativi. È basato sul codice progetto open source KUI: https://github.com/IBM/kui.",
  "gettingStarted:content": "Il terminale Visual Web è un'interfaccia che combina i vantaggi di un'interfaccia utente grafica con la velocità di un'interfaccia di riga comandi. Dopo aver eseguito un comando, i dati vengono restituiti in un formato tabella interattivo che può visualizzare maggiori dettagli su un elemento quando tale elemento viene selezionato nella tabella.\n \n Oltre ai comandi specifici di Visual Web Terminal, sono supportati anche i seguenti comandi:\n * Determinati comandi `bash` basilari\n * Comandi `cloudctl`\n * Comandi `helm`\n * Comandi `istioctl`\n * Comandi `kubectl`\n * Comandi `oc`\n \n**Applicazioni**\n \n Ora è possibile visualizzare e accedere alle informazioni sulle applicazioni nel proprio ambiente utilizzando comandi `kubectl` con Visual Web Terminal.\n \n * Mostra tutte le applicazioni:\n \n `kubectl get applications`\n \n * Mostra tutte le distribuzioni:\n \n `kubectl get deployments`\n \n * Mostra tutti i canali:\n \n `kubectl get channels`\n \n **Cerca** (disponibile solo quando IBM Cloud Pak for Multicloud Management è installato sul cluster)\n \n È possibile cercare una stringa o un attributo nell'intero ambiente di gestione cloud connesso utilizzando il comando `search`. È possibile ridurre i risultati della ricerca con i filtri, aggiungendoli alla fine del comando di ricerca.\n \n Il comando `search` restituisce risultati che sono categorizzati per tipo in formato tabella. È possibile ordinare i dati nella tabella selezionando l'intestazione di colonna per i dati che si desidera utilizzare per l'ordinamento.\n \n Per visualizzare ulteriori dettagli su un elemento restituito nella tabella, selezionare il nome dell'elemento.\n \n * Esempio di ricerca per indirizzo IP:\n \n `search 192.0.0.1`\n \n * Esempi di ricerche con filtri:\n \n Tipologia di risorsa:\n \n `search kind:deployment`\n \n * Proprietario:\n \n search owner:jdoe\n \n * Filtri multipli:\n \n `search kind:deployment owner:jdoe`"
}