{
  "about": "Sobre",
  "gettingStarted": "Como Começar",
  "configure": "Configurar",
  "about:content": "O Visual Web Terminal oferece uma nova experiência de desenvolvimento para construir aplicativos em nuvem nativa, combinando o poder de várias CLIs com a conveniência das visualizações. O Visual Web Terminal permite executar comandos a partir de várias ferramentas, exibir e navegar por modelos de dados `JSON` e `YAML` complexos e visualizar dados operacionais. Desenvolvido usando o código do projeto de software livre do KUI: https://github.com/IBM/kui.",
  "gettingStarted:content": "O Terminal da Web Visual é uma interface que combina a conveniência de uma interface gráfica com o usuário com a velocidade de uma interface da linha de comandos. Após a execução de um comando, os dados são retornados em um formato de tabela interativo que pode exibir mais detalhes sobre um item quando você seleciona esse item na tabela.\n \n Além dos comandos específicos do Visual Web Terminal, os comandos a seguir também são suportados:\n * Comandos `bash` básicos selecionados\n * Comandos `cloudctl`\n * Comandos `helm`\n * Comandos `kubectl`  \n * Comandos `oc`\n \n**Aplicativos**\n \n É possível visualizar e acessar informações sobre os aplicativos em seu ambiente usando os comandos `kubectl` com o Visual Web Terminal. \n \n * Mostrar todos os aplicativos:\n \n `kubectl get applications`\n \n * Mostrar todas as implementações:\n \n `kubectl get deployments`\n \n * Mostrar todos os canais:\n \n `kubectl get channels`\n \n **Procura** (disponível somente quando o IBM Cloud Pak for Multicloud Management está instalado no cluster)\n \n É possível procurar uma sequência ou atributo em todo o seu ambiente de gerenciamento de nuvem conectado usando o comando `search`.  É possível limitar seus resultados da procura com filtros, incluindo-os no final do comando de procura.\n \n O comando `search` retorna resultados que são categorizados por tipo em um formato de tabela. É possível classificar os dados na tabela selecionando o título da coluna para os dados que você deseja usar para classificação.\n \n Para visualizar detalhes adicionais sobre um item que foi retornado na tabela, selecione o nome do item.\n \n * Exemplo de uma procura para um endereço IP:\n \n `search 192.0.0.1`\n \n * Exemplos de procuras usando filtros:\n \n Tipo de recurso:\n \n `search kind:deployment`\n \n * Proprietário:\n \n search owner:jdoe\n \n * Múltiplos filtros:\n \n `search kind:deployment owner:jdoe`"
}